3devo/Arduino-3devo/stm32/boards.txt
granulate_processor_mainboard.menu.upload_method.dfuUtil=dfu-util with serial autoreset
granulate_processor_mainboard.menu.upload_method.dfuUtil.upload.tool=dfuUtil
granulate_processor_mainboard.menu.upload_method.dfuUtil.upload.use_1200bps_touch=true
granulate_processor_mainboard.menu.upload_method.dfuUtil.upload.options=
# This must exist, otherwise the IDE falls back to upload using programmer
granulate_processor_mainboard.menu.upload_method.dfuUtil.upload.protocol=

granulate_processor_mainboard.menu.upload_method.MassStorage=Mass Storage
granulate_processor_mainboard.menu.upload_method.MassStorage.upload.protocol=
granulate_processor_mainboard.menu.upload_method.MassStorage.upload.tool=STM32-3devo:massStorageCopy

granulate_processor_mainboard.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
granulate_processor_mainboard.menu.upload_method.swdMethod.upload.protocol=0
granulate_processor_mainboard.menu.upload_method.swdMethod.upload.options=-g
granulate_processor_mainboard.menu.upload_method.swdMethod.upload.tool=STM32-3devo:stm32CubeProg

granulate_processor_mainboard.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
granulate_processor_mainboard.menu.upload_method.serialMethod.upload.protocol=1
granulate_processor_mainboard.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
granulate_processor_mainboard.menu.upload_method.serialMethod.upload.tool=STM32-3devo:stm32CubeProg

granulate_processor_mainboard.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
granulate_processor_mainboard.menu.upload_method.dfuMethod.upload.protocol=2
granulate_processor_mainboard.menu.upload_method.dfuMethod.upload.options=-g
granulate_processor_mainboard.menu.upload_method.dfuMethod.upload.tool=STM32-3devo:stm32CubeProg
granulate_processor_mainboard.menu.upload_method.dfuMethod.upload.use_1200bps_touch=true

################################################################################
# TODO: Remove a bunch of these options once we are sure what we need.
# Serialx activation
granulate_processor_mainboard.menu.xserial.none=Enabled (no generic 'Serial')
granulate_processor_mainboard.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
granulate_processor_mainboard.menu.xserial.generic=Enabled (generic 'Serial')
granulate_processor_mainboard.menu.xserial.disabled=Disabled (No Serial support)
granulate_processor_mainboard.menu.xserial.disabled.build.xSerial=

# USB connectivity
granulate_processor_mainboard.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
granulate_processor_mainboard.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
granulate_processor_mainboard.menu.usb.CDC=CDC (no generic 'Serial')
granulate_processor_mainboard.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
granulate_processor_mainboard.menu.usb.HID=HID (keyboard and mouse)
granulate_processor_mainboard.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
granulate_processor_mainboard.menu.usb.none=None
granulate_processor_mainboard.menu.xusb.FS=Low/Full Speed
granulate_processor_mainboard.menu.xusb.HS=High Speed
granulate_processor_mainboard.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
granulate_processor_mainboard.menu.xusb.HSFS=High Speed in Full Speed mode
granulate_processor_mainboard.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
granulate_processor_mainboard.menu.opt.osstd=Smallest (-Os default)
granulate_processor_mainboard.menu.opt.oslto=Smallest (-Os) with LTO
granulate_processor_mainboard.menu.opt.oslto.build.flags.optimize=-Os -flto
granulate_processor_mainboard.menu.opt.o1std=Fast (-O1)
granulate_processor_mainboard.menu.opt.o1std.build.flags.optimize=-O1
granulate_processor_mainboard.menu.opt.o1lto=Fast (-O1) with LTO
granulate_processor_mainboard.menu.opt.o1lto.build.flags.optimize=-O1 -flto
granulate_processor_mainboard.menu.opt.o2std=Faster (-O2)
granulate_processor_mainboard.menu.opt.o2std.build.flags.optimize=-O2
granulate_processor_mainboard.menu.opt.o2lto=Faster (-O2) with LTO
granulate_processor_mainboard.menu.opt.o2lto.build.flags.optimize=-O2 -flto
granulate_processor_mainboard.menu.opt.o3std=Fastest (-O3)
granulate_processor_mainboard.menu.opt.o3std.build.flags.optimize=-O3
granulate_processor_mainboard.menu.opt.o3lto=Fastest (-O3) with LTO
granulate_processor_mainboard.menu.opt.o3lto.build.flags.optimize=-O3 -flto
granulate_processor_mainboard.menu.opt.ogstd=Debug (-Og)
granulate_processor_mainboard.menu.opt.ogstd.build.flags.optimize=-Og

# C Runtime Library
granulate_processor_mainboard.menu.rtlib.nano=Newlib Nano (default)
granulate_processor_mainboard.menu.rtlib.nanofp=Newlib Nano + Float Printf
granulate_processor_mainboard.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
granulate_processor_mainboard.menu.rtlib.nanofs=Newlib Nano + Float Scanf
granulate_processor_mainboard.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
granulate_processor_mainboard.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
granulate_processor_mainboard.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
granulate_processor_mainboard.menu.rtlib.full=Newlib Standard
granulate_processor_mainboard.menu.rtlib.full.build.flags.ldspecs=

##########################################################################################
# Based on generic STM32G0 board
gp20_hopperboard.name=GP20 Hopperboard

gp20_hopperboard.build.core=STM32-3devo:arduino
gp20_hopperboard.build.mcu=cortex-m0plus
gp20_hopperboard.build.series=STM32G0xx
gp20_hopperboard.build.cmsis_lib_gcc=arm_cortexM0l_math
# This enables -g always, which can be removed if this is fixed upstream
# https://github.com/stm32duino/Arduino_Core_STM32/issues/873
gp20_hopperboard.build.extra_flags=-D{build.product_line} {build.xSerial} -D__CORTEX_SC=0 -g

gp20_hopperboard.upload.maximum_size=65536
gp20_hopperboard.upload.maximum_data_size=8192
gp20_hopperboard.build.board=STM32_GP20_HOPPERBOARD
gp20_hopperboard.build.product_line=STM32G030xx
gp20_hopperboard.build.variant=GP20_Hopperboard

# Upload menu
gp20_hopperboard.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
gp20_hopperboard.menu.upload_method.swdMethod.upload.protocol=0
gp20_hopperboard.menu.upload_method.swdMethod.upload.options=-hardRst
gp20_hopperboard.menu.upload_method.swdMethod.upload.tool=STM32-3devo:stm32CubeProg

gp20_hopperboard.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
gp20_hopperboard.menu.upload_method.serialMethod.upload.protocol=1
gp20_hopperboard.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
gp20_hopperboard.menu.upload_method.serialMethod.upload.tool=STM32-3devo:stm32CubeProg

