3devo/Arduino-3devo/stm32/boards.txt
# Serial menu
gp20_hopperboard.menu.xserial.generic=Enabled (generic 'Serial')
gp20_hopperboard.menu.xserial.none=Enabled (no generic 'Serial')
gp20_hopperboard.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
gp20_hopperboard.menu.xserial.disabled=Disabled (no Serial support)
gp20_hopperboard.menu.xserial.disabled.build.xSerial=

# Optimization menu
gp20_hopperboard.menu.opt.osstd=Smallest (-Os default)
gp20_hopperboard.menu.opt.oslto=Smallest (-Os) with LTO
gp20_hopperboard.menu.opt.oslto.build.flags.optimize=-Os -flto
gp20_hopperboard.menu.opt.o1std=Fast (-O1)
gp20_hopperboard.menu.opt.o1std.build.flags.optimize=-O1
gp20_hopperboard.menu.opt.o1lto=Fast (-O1) with LTO
gp20_hopperboard.menu.opt.o1lto.build.flags.optimize=-O1 -flto
gp20_hopperboard.menu.opt.o2std=Faster (-O2)
gp20_hopperboard.menu.opt.o2std.build.flags.optimize=-O2
gp20_hopperboard.menu.opt.o2lto=Faster (-O2) with LTO
gp20_hopperboard.menu.opt.o2lto.build.flags.optimize=-O2 -flto
gp20_hopperboard.menu.opt.o3std=Fastest (-O3)
gp20_hopperboard.menu.opt.o3std.build.flags.optimize=-O3
gp20_hopperboard.menu.opt.o3lto=Fastest (-O3) with LTO
gp20_hopperboard.menu.opt.o3lto.build.flags.optimize=-O3 -flto
gp20_hopperboard.menu.opt.ogstd=Debug (-g)
gp20_hopperboard.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime menu
gp20_hopperboard.menu.rtlib.nano=Newlib Nano (default)
gp20_hopperboard.menu.rtlib.nanofp=Newlib Nano + Float Printf
gp20_hopperboard.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
gp20_hopperboard.menu.rtlib.nanofs=Newlib Nano + Float Scanf
gp20_hopperboard.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
gp20_hopperboard.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
gp20_hopperboard.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
gp20_hopperboard.menu.rtlib.full=Newlib Standard
gp20_hopperboard.menu.rtlib.full.build.flags.ldspecs=
